ascii schema replaced by mermaid
